#include <stdio.h>

int main() { // ฟังก์ชันหลักของโปรแกรม
    // ประกาศตัวแปร
    float a = 0.617; // ตัวแปร float สำหรับเก็บค่า a เป็นทศนิยม
    float b = 25.0; // ตัวแปร float สำหรับเก็บค่า b เป็นจำนวนเต็ม
    float c = 19.0; // ตัวแปร float สำหรับเก็บค่า c เป็นจำนวนเต็ม
    float d = 9.0; // ตัวแปร float สำหรับเก็บค่า d เป็นจำนวนเต็ม
    float e = 124.555; // ตัวแปร float สำหรับเก็บค่า e เป็นทศนิยม
    float f = 0.001; // ตัวแปร float สำหรับเก็บค่า f เป็นทศนิยม

    printf("a= %.3f%%\n", a); // แสดงผลค่า a ในรูปทศนิยม 3 ตำแหน่ง โดยใช้ %.3f
    printf("b= %3.0f%%\n", b); // แสดงผลค่า b ในรูปจำนวนเต็ม 3 หลัก โดยไม่มีจุดทศนิยม
    printf("c =%.3f%%\n", c); // แสดงผลค่า c ในรูปทศนิยม 3 ตำแหน่ง โดยใช้ %.3f
    printf("d  =%-2.0f%%\n", d); // แสดงผลค่า d ในรูปจำนวนเต็ม 2 หลัก โดยใช้ - เพื่อจัดตำแหน่งให้ชิดซ้าย
    printf("e=%.3f%%\n", e); // แสดงผลค่า e ในรูปทศนิยม 3 ตำแหน่ง โดยใช้ %.3f
    printf("f=%.3f%%\n", f); // แสดงผลค่า f ในรูปทศนิยม 3 ตำแหน่ง โดยใช้ %.3f

    return 0; // คืนค่า 0 เพื่อบอกว่าการทำงานสำเร็จ
}